Autodesk.Revit.DB.Structure.AnalyticalModelStick.RemoveAllMemberForces
Removes all member forces associated with element.
Returns:
True if any member forces were removed, false otherwise.
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.RemoveMemberForces(System.Boolean)
Removes member forces defined for given position.
start:
Member Forces position on analytical model stick element. True for start, false for end.
Returns:
True if member forces for provided position were removed, false otherwise.
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetMemberForces(Autodesk.Revit.DB.Structure.MemberForces)
Sets Member Forces to element.
Remarks:
If element already have member forces defined for that end, newly provided values replace current one.
Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
memberForces:
End to which member forces will be added is defined by setting Autodesk::Revit::DB::Structure::MemberForces::Position
property in provided Member Forces object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetMemberForces(System.Boolean,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Adds Member Forces to element.
Remarks:
If element already have member forces defined for that end, newly provided values replace current one.
Member forces are strictly related with releases. This means that setting member forces values is reasonable only for directions that have releases set to false.
start:
Member Forces position on analytical model stick element. True for start, false for end.
force:
The translational forces at specified position of the element.
The x value of XYZ object represents force along x-axis of the analytical model coordinate system, y along y-axis, z along z-axis respectively.
moment:
The rotational forces at specified position of the element.
The x value of XYZ object represents moment about x-axis of the analytical model coordinate system, y about y-axis, z about z-axis respectively.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetMemberForces
Gets the member forces associated with this element.
Remarks:
Using this method require transaction.
Member forces are strictly related with releases. This means that we can obtain member forces values only for directions that have releases set to false.
Force or moment component on direction that have release set to true is skipped (zeroed) during getting.
Returns:
Returns a collection of Member Forces associated with this element. Empty collection will be returned if element doesn't have any Member Forces.
To find out with which end member forces are associated use Autodesk::Revit::DB::Structure::MemberForces::Position
property to obtain a position of Member Forces on element.
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetReleases(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Sets the releases of element.
start:
The position on analytical model stick element. True for start, false for end.
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetReleases(System.Boolean,System.Boolean@,System.Boolean@,System.Boolean@,System.Boolean@,System.Boolean@,System.Boolean@)
Gets the releases of element.
start:
The position on analytical model stick element. True for start, false for end.
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetReleaseType(System.Boolean,Autodesk.Revit.DB.Structure.ReleaseType)
Sets the release type.
start:
The position on analytical model stick element. True for start, false for end.
releaseType:
The type of release.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetReleaseType(System.Boolean)
Gets the release type.
start:
The position on analytical model stick element. True for start, false for end.
Returns:
The type of release.
Since:
2016

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetProjection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the analytical model projection to a preset value.
selector:
End of the analytical model.
planeIdY:
Plane on to which analytical model may be projected in Y direction.
Plane identifies a Level, a Grid, or a Ref Plane.
planeIdZ:
Plane on to which analytical model may be projected in Z direction.
Plane identifies a Level, a Grid, or a Ref Plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetProjection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.StickElementProjectionY,Autodesk.Revit.DB.ElementId)
Sets the analytical model projection to a preset value.
selector:
End of the analytical model.
projectionY:
Preset value for Analytical Model Stick projection Y.
planeIdZ:
Plane on to which analytical model may be projected in Z direction.
Plane identifies a Level, a Grid, or a Ref Plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetProjection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.StickElementProjectionZ)
Sets the analytical model projection to a preset value.
selector:
End of the analytical model.
planeIdY:
Plane on to which analytical model may be projected in Y direction.
Plane identifies a Level, a Grid, or a Ref Plane.
projectionZ:
Preset value for Analytical Model Stick projection Z.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetProjection(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.StickElementProjectionY,Autodesk.Revit.DB.Structure.StickElementProjectionZ)
Sets the analytical model projection to a preset value.
Remarks:
This should be used if setting the analytical model projection to something
other than a Plane.
selector:
End of the analytical model.
projectionY:
Preset value for Analytical Model Stick projection Y.
projectionZ:
Preset value for Analytical Model Stick projection Z.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.SetAlignmentMethod(Autodesk.Revit.DB.Structure.AnalyticalElementSelector,Autodesk.Revit.DB.Structure.AnalyticalAlignmentMethod)
Sets the alignment method for a given selector.
selector:
End of the analytical model.
method:
The alignment method at a given end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetAlignmentMethod(Autodesk.Revit.DB.Structure.AnalyticalElementSelector)
Gets the alignment method for a given selector.
selector:
End of the analytical model.
Returns:
The alignment method at a given end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetProjectionPlaneZ(Autodesk.Revit.DB.Structure.AnalyticalElementSelector)
Retrieves analytical model projection information for Z direction.
selector:
End of the analytical model.
Returns:
Plane on to which analytical model is projected, or invalidElementId if
not projected to a Plane.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetProjectionPlaneY(Autodesk.Revit.DB.Structure.AnalyticalElementSelector)
Retrieves analytical model projection information for Y direction.
selector:
End of the analytical model.
Returns:
Plane on to which analytical model is projected, or invalidElementId if
not projected to a Plane.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetProjectionZ(Autodesk.Revit.DB.Structure.AnalyticalElementSelector)
Retrieves analytical model projection information for Z direction.
selector:
End of the analytical model.
Returns:
Indicates if the projection is a preset value, or refers to a Plane.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetProjectionY(Autodesk.Revit.DB.Structure.AnalyticalElementSelector)
Retrieves analytical model projection information for Y direction.
selector:
End of the analytical model.
Returns:
Indicates if the projection is a preset value, or refers to a Plane.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetLocalCoordinateSystem(System.Double)
Gets the local coordinate system (LCS) that reflects analytical model orientation at the specified parameter value along a curve.
parameter:
The parameter value along a curve that should be in the range [0, 1], where 0 represents start and 1 represents end of the element.
Returns:
Transformation matrix.
x - longitudinal axis, y - transversal, section - horizontal, strong axis, z - transversal, section - vertical, weak axis, origin - base point of LCS.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The parameter is out of range from 0 to 1.
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick.GetLocalCoordinateSystem(Autodesk.Revit.DB.XYZ)
Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
point:
The point on the analytical model stick element.
Returns:
Transformation matrix.
x - longitudinal axis, y - transversal, section - horizontal, strong axis, z - transversal, section - vertical, weak axis, origin - base point of LCS.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The point does not lie on the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelStick
An element that represents a stick in the structural analytical model.
Could be one of beam, brace or column type.
Since:
2015